In [3]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [4]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [5]:
%%sql
SELECT * from facts LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [22]:
%%sql
SELECT MIN(population) AS 'Min Population', 
       MAX(population) AS 'Max Population',
       MIN(population_growth) AS 'Min Population Growth',
       MAX(population_growth)  AS 'Max Population Growth'
    FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [13]:
%%sql
SELECT name, population from facts WHERE population IN (SELECT MIN(population) FROM facts);

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

In [15]:
%%sql
SELECT name, population from facts WHERE population IN (SELECT MAX(population) FROM facts);

 * sqlite:///factbook.db
Done.

[('World', 7256490011)]

In [21]:
%%sql
SELECT MIN(population) AS 'Min Population', 
       MAX(population) AS 'Max Population',
       MIN(population_growth) AS 'Min Population Growth',
       MAX(population_growth)  AS 'Max Population Growth'
    FROM facts 
    WHERE name != 'World';

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [20]:
%%sql
SELECT ROUND(AVG(population), 2) as 'average population', ROUND(AVG(area), 2) as 'average area' FROM facts WHERE name != 'World';

 * sqlite:///factbook.db
Done.

[(32242666.57, 555093.55)]

In [24]:
%%sql
SELECT name, population, area
   FROM facts
    WHERE population > (SELECT AVG(population) FROM facts)
      AND area < (SELECT AVG(area) FROM facts);

 * sqlite:///factbook.db
Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Japan', 126919659, 377915),
 ('Philippines', 100998376, 300000),
 ('Thailand', 67976405, 513120),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]